{
  "title": "The Star Formation History and Evolution of the Ultra-Diffuse M81\n  Satellite, F8D1",
  "authors": [
    "Adam Smercina",
    "Eric F. Bell",
    "Benjamin F. Williams",
    "Benjamin N. Velguth",
    "Sarah Pearson",
    "Jeremy Bailin",
    "Tsang Keung Chan",
    "Julianne J. Dalcanton",
    "Roelof S. de Jong",
    "Richard D'Souza",
    "Andrew Dolphin",
    "Puragra Guhathakurta",
    "Kristen B. W. McQuinn",
    "Antonela Monachesi",
    "Colin T. Slater",
    "Elisa Toloba",
    "Daniel R. Weisz",
    "Andrew Wetzel"
  ],
  "abstract": "We present deep HST imaging of one of the nearest ultra-diffuse galaxies\n(UDGs) outside of the Local Group: F8D1, a satellite of M81 known to be tidally\ndisrupting. UDGs are an enigmatic and diverse population, with evolutionary\npathways ranging from tidal processing to bursty feedback and high initial\nangular momentum. To determine F8D1's evolutionary drivers, we resolve stars in\nF8D1's central $\\sim$1 kpc and in a parallel field $\\sim$6 kpc along its major\naxis to deep photometric limits, reaching below the Red Clump. We also image\neight shallower fields along F8D1's major and minor axes. We calculate the star\nformation history (SFH) in the two deep fields, finding that while currently\nquiescent, both regions experienced a substantial burst $\\sim$2 Gyr ago and a\nsmaller burst $\\sim$500 Myr ago, which likely formed F8D1's nuclear star\ncluster. In the shallow fields, using the ratio of evolved Asymptotic Giant\nBranch and Red Giant Branch stars out to $\\sim$13 kpc along F8D1's known\nstellar stream, we confirm that F8D1 was globally star-forming until at least 2\nGyr ago. We estimate a total progenitor stellar mass, including the stream, of\n$\\sim$1.3$\\times$10$^8\\ M_{\\odot}$, with an average [M/H] $\\sim$ $-$0.8. We\ncompare F8D1's properties to those of Local Group galaxies with similar initial\nstellar mass. We find that F8D1 is consistent with a progenitor star-forming\ngalaxy similar to NGC 6822, which is in the midst of a transition to a\nSagittarius-like system. Notably, this evolutionary sequence can be\naccomplished through tidal processing alone, in galaxies that have experienced\nsufficiently bursty feedback to create cored profiles.",
  "url": "http://arxiv.org/abs/2507.13349v1",
  "pdf_url": "http://arxiv.org/pdf/2507.13349v1.pdf",
  "publication_date": "2025-07-17",
  "venue": "arXiv preprint",
  "citation_count": null,
  "source": "arxiv"
}